import { Track } from "@/src/features/player/types";

export const products = [
    {
      id: 1,
      title: "ИНТЕРНЕТ-МАГАЗИН",
      description: "Создам интернет магазин со всем нужным функционалом для полноценной работы: приветственный лендинг, каталог товаров, корзина, понравившееся.",
      price: "$1500",
      images: ["/studiau2.jpg", "/studiau1.jpg", "/studiau3.jpg", "/studiau4.jpg", "/dveri1.jpg", "/dveri2.jpg", "/dveri3.jpg", "/dveri4.jpg"],
      category: "РАЗРАБОТКА",
    },
    {
      id: 2,
      title: "СОВРЕМЕМННЫЙ ЛЕНДИНГ",
      description: "Реализую современный красивый лендинг с уникальным дизайном для представления вашего бренда. Одностраничный сайт с акцентом на коверсию",
      price: "$1000",
      images: ["/israil1.jpg", "/israil2.jpg", "/israil3.jpg", "/israil4.jpg", "/israil5.jpg", "/israil6.jpg", "/israil7.jpg"],
      category: "РАЗРАБОТКА",
    },
    {
      id: 3,
      title: "САЙТ-ВИЗИТКА",
      description: "Реализую сайт выполняющий информационную функцию, подойдет для представления компаний, специалистов или услуг.",
      price: "$500",
      images: ["/centr.jpg", "/centr2.jpg", "/centr3.jpg"],
      category: "РАЗРАБОТКА",
    },
    {
      id: 4,
      title: "TELEGRAM MINI APP + ТГ БОТ",
      description: "Телеграм Мини Приложения для ваших задач, от мини игр до полноценных банковских приложений внутри телеграм. ",
      price: "$500",
      images: ["/maketma.jpg"],
      category: "РАЗРАБОТКА",
    },
    {
      id: 5,
      title: "ПАРСЕРЫ",
      description: "Разработка кастомных веб-парсеров под любые задачи: сбор данных с сайтов, маркетплейсов, агрегаторов. Гибкие настройки, автоматизация, экспорт в Excel, JSON и базы данных. Работаю под ключ с техническим заданием.",
      price: "$500",
      images: ["/parsers.jpg"],
      category: "РАЗРАБОТКА",
    },
    {
      id: 6,
      title: "MIXING",
      description: "Профессиональное сведение треков: выравнивание частот, панорамирование, динамическая обработка. Работаю в любом жанре. Готовлю звучание к мастерингу и релизу. Пример звучания можно получить по запросу.",
      price: "$500",
      images: ["/mixing.png"],
      category: "СВЕДЕНИЕ",
    },
    {
      id: 7,
      title: "MASTERING",
      description: "Финальная обработка трека перед релизом: loudness, ширина, частотный баланс, динамика. Гарантирую конкурентное звучание для Spotify, Apple Music и др. Мастеринг после сведения или под чужой микс.",
      price: "$500",
      images: ["/mastering.png"],
      category: "СВЕДЕНИЕ",
    },
    {
      id: 9,
      title: "MP3 LEASE BY SPACY &/(???)",
      description: "Бюджетная лицензия на аренду бита в формате MP3. Разрешено коммерческое использование, выступления и публикация в стриминговых сервисах. Ограничение: до 100 000 прослушиваний. Обязательное указание продюсеров (prod. by kennycarter, yungdexn).",
      price: "$500",
      images: ["/mp3lease.png"],
      category: "БИТЫ",
    },
    {
      id: 10,
      title: "WAV LEASE BY SPACY &/(???)",
      description: "Премиум аренда WAV-файла с тегом. Включено коммерческое использование, цифровые магазины, выступления. Ограничение: до 100 000 прослушиваний. Обязательное указание авторства (prod. by kennycarter, yungdexn).",
      price: "$500",
      images: ["/wavlease.png"],
      category: "БИТЫ",
    },
    {
      id: 11,
      title: "EXCLUSIVE BY SPACY &/(???)",
      description: "Полный выкуп прав на бит. Вы получаете MP3, WAV и TRACKOUT. Коммерческое использование, неограниченные прослушивания, возможность удалить тег. Авторство сохраняется, но бит снимается с продажи. Цена зависит от бита. Свяжитесь для обсуждения.",
      price: "$500",
      images: ["/exclusivelease.png"],
      category: "БИТЫ",
    }

  ];

export const features = [
    {
      title: "ВЕБ-РАЗРАБОТКА",
      description:
        "Создам под ключ уникальный и стильный сайт под стилистику вашего бренда с возможностью дальнейшего масштабирования. Стек технологий подбирается индивидуально под каждый случай, я использую исключительно современные и удобные для обеих сторон технологии. Стек технологий, если интересно: \n\n BACKEND - Python, FastAPI, Flask, Django Rest Framework/Django, Express.js, Node.js \n\n FRONTEND - JS, React.js/Next.js, Angular.js, SCSS, TailwindCSS \n\n Плюсом, могу внедрять AI в ваши проекты при вашем желании, в текущее время такой функционал все еще может очень удивить вашего пользователя и обеспечить выгоду вашему бизнесу.",
      image: "/hero.jpg",
      image2: "/hero-2.jpg",
    },
    {
      title: "СВЕДЕНИЕ ТРЕКОВ И БИТЫ",
      description:
        "Сделаю миксинг и мастеринг вашего трека, могу работать с любым исходником, но чем лучше исходник тем лучше конечный результат. Можете написать мне с этого сайта в тг @bigmoneymgmt и получить скидку в 30% от указанного в прайсе! Промокод - #SPC2025 \n\n Так же вы можете приобрести биты по уже утвержденному прайсу либо заказать кастомный бит под ваш стиль. Вы получите договор при покупке соответсвующей лицензии \n\n Но скоро вы сможете это делать максимально удобно, покупать и продавать биты в сбалансированной экосистеме между друг другом но, это - совсем другая история)) \n\n#SEAMUSIC2025, WE MAKE IT SINCE 2023, JUST WAIT..",
      image: "/hero-3.jpg",
      image2: "/hero-2.jpg",
    },
    {
      title: "WORK TOGETHER",
      description:
        "По скольку мой спектр услуг распыляется и я имею свои собственные проекты, довольно тяжело обслуживать сразу несколько разных заказчиков без собственной команды, но при этом хочется продолжать обеспечивать качественную работу в сроки каждому. \n\n Всегда в таких случаях нужно расширяться, иметь команду которая будет ответственно выполнять свою работу в взаимовыгодных условиях. Каждый человек в команде будет заниматься своей частью работы, в то же время предоставляя качественный конечный результат. Все условия обговариваются индивидуально взависимости от ваших навыков, каждая работа будет происходить под моим присмотром, в случае чего вы сможете задавать свои вопросы, и нет, это не онлайн школа - это полноценный фриланс. Вы примите участие в моих проектах, а так же в некоторых заказах \n\n P.S Все заказчики могут выдохнуть, вся работа будет максимально прозрачна и проверена профессионалами. ",
      image: "/hero-3.jpg",
      image2: "/hero.jpg",
    },
  ];
  
export const tracks: Track[] = [
  {
    id: 1,
    title: "SPC.RU TYPE BEAT",
    artist: "SPACY?",
    imageSrc: "/cbmc.jpg",
    audioSrc: "beat1.mp3",
    tags: ["#spacy", "#drill", "#typebeat"],
  },
  {
    id: 2,
    title: "GHOST IN SHELL",
    artist: "KENNY CARTER",
    imageSrc: "/ghost.jpg",
    audioSrc: "beat2.mp3",
    tags: ["#phonk", "#cinematic"],
  },
  {
    id: 3,
    title: "FOR CLUBS ONLY",
    artist: "YUNGDEXN",
    imageSrc: "/club.jpg",
    audioSrc: "beat3.mp3",
    tags: ["#club", "#bouncy", "#trap"],
  },
  {
    id: 4,
    title: "CRYOGENIC",
    artist: "SPACY?",
    imageSrc: "/ice.jpg",
    audioSrc: "beat4.mp3",
    tags: ["#ambient", "#experimental"],
  },
  {
    id: 5,
    title: "MOTIONLESS",
    artist: "DEXTER&SPC",
    imageSrc: "/motion.jpg",
    audioSrc: "beat5.mp3",
    tags: ["#slow", "#cloud", "#emotional"],
  },
];


export const texts = ["ТВОЕГО", "ВАШЕГО", "ЛЮБОГО"];  
export const typingSpeed = 200;
export const pauseTime = 2500;
  